Mikhail-Za/DualMesh-Boot-Launcher-for-LilyGo-T-Display-P4/launcher/sdkconfig.defaults
# T-Display P4 ships ESP32-P4 rev v1.0 silicon — pre-v3 and v3+ are mutually
# exclusive build targets. Without these two lines the binary refuses to flash/boot.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_dualmesh.csv"

# Match the flash mode/freq of the stock MeshOS image header (DIO @ 80MHz)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Factory slot is 896KB — optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# GRUB-mode boot flow: app rollback makes every esp_ota_set_boot_partition a
# ONE-SHOT boot. The booted firmware (closed-source MeshOS) never confirms the
# image, so the next reset returns to the factory launcher, which shows a
# tap-to-interrupt splash and auto-boots the last choice. No buttons needed.
# (GPIO35 factory-reset was abandoned: it is the download strap — holding it at
# reset enters ROM download mode, and the bootloader samples it too early to
# press afterwards. See notes/session-log.md.)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# LilyGo device driver: T-Display P4 board, info logging
CONFIG_LILYGO_DEVICE_DRIVER_T_DISPLAY_P4=y
CONFIG_CPP_BUS_DRIVER_LOG_LEVEL_INFO=y
CONFIG_LILYGO_DEVICE_DRIVER_LOG_LEVEL_INFO=y

# 32MB PSRAM (hex mode @200MHz) — LVGL draw buffer lives here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000

# SD card: FAT32 with long filenames
CONFIG_FATFS_LFN_HEAP=y

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20=y
